SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sayak="http://soap.sforce.com/schemas/class/WelcomeSOAP">
    <soapenv:Header>
        <sayak:SessionHeader>         
             <sayak:sessionId>00D5j00000B8uvH!ARMAQC5aCWYBekGTepGrk0nV3LosHQ00nmtYdng3CcdSwlwZTzTJCj05Q940uDuBGH0tAUf00jukIgxoJskqb5Ibo.iJ6lqg</sayak:sessionId>
        </sayak:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <sayak:fullName>
            <sayak:firstName>Sayak</sayak:firstName>
            <sayak:lastName>Haldar</sayak:lastName>
        </sayak:fullName>
    </soapenv:Body>
</soapenv:Envelope>

<!-- <?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sayak="http://soap.sforce.com/schemas/class/WelcomeSOAP">
    <soapenv:Header>
        <sayak:SessionHeader>         
             <sayak:sessionId>00D5j00000B8uvH!ARMAQFpAzqRuTibxLsNLOP6rOEQycxTtDzHA8QigTgpFg..9DvPgxjTv5Q81gz48O8vQv1nmGueJ0W5dlj34hY15q8pMLDqH</sayak:sessionId>
        </sayak:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <sayak:createAccount>
            <sayak:wrapper>
                <sayak:Name>Test Account From SOAP</sayak:Name>
                <sayak:Rating>Hot</sayak:Rating>
                <sayak:Industry>Education</sayak:Industry>
                <sayak:Phone>8977809988</sayak:Phone>
                <sayak:AccountNumber>BBSH678SH78A</sayak:AccountNumber>
                <sayak:conRecord>
                    <sayak:FirstName>Sayak</sayak:FirstName>
                    <sayak:LastName>Haldar</sayak:LastName>
                </sayak:conRecord>
            </sayak:wrapper>
        </sayak:createAccount>
    </soapenv:Body>
</soapenv:Envelope> -->